In [1]:
import pandas as pd
from sqlalchemy import create_engine

from config import password

### Extract CSVs into DataFrames

In [2]:
cities_file = "cities15000.csv"
cities_df = pd.read_csv(cities_file, encoding = "ISO-8859-1")
cities_df.head()

,geonameid,name,asciiname,alternatenames,latitude,longitude,feature class,feature code,country code,cc2,admin1 code,admin2 code,admin3 code,admin4 code,population,elevation,dem,timezone,modification date
0,3040051,les Escaldes,les Escaldes,"Ehskal'des-Ehndzhordani,Escaldes,Escaldes-Engo...",42.50729,1.53414,P,PPLA,AD,NaN,8,NaN,NaN,NaN,15853,NaN,1033.0,Europe/Andorra,10/15/2008
1,3041563,Andorra la Vella,Andorra la Vella,"ALV,Ando-la-Vyey,Andora,Andora la Vela,Andora ...",42.50779,1.52109,P,PPLC,AD,NaN,7,NaN,NaN,NaN,20430,NaN,1037.0,Europe/Andorra,5/30/2010
2,290594,Umm al Qaywayn,Umm al Qaywayn,"Oumm al Qaiwain,Oumm al QaÌøwaÌøn,Um al Kawain...",25.56473,55.55517,P,PPLA,AE,NaN,7,NaN,NaN,NaN,44411,NaN,2.0,Asia/Dubai,10/7/2014
3,291074,Ras al-Khaimah,Ras al-Khaimah,"Julfa,Khaimah,RKT,Ra's al Khaymah,Ra's al-Chai...",25.78953,55.9432,P,PPLA,AE,NaN,5,NaN,NaN,NaN,115949,NaN,2.0,Asia/Dubai,12/5/2015
4,291696,Khawr Fakkn,Khawr Fakkan,"Fakkan,Fakkn,Khawr Fakkan,Khawr Fakkn,Khaw...",25.33132,56.34199,P,PPL,AE,NaN,6,NaN,NaN,NaN,33575,NaN,20.0,Asia/Dubai,10/25/2013

In [3]:
cost_liv_file = "Cost_of_living_index.csv"
cost_liv_df = pd.read_csv(cost_liv_file)
cost_liv_df.head()

,Rank,City,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,1,"Hamilton, Bermuda",137.56,103.03,121.21,126.56,151.77,114.19
1,2,"Zurich, Switzerland",128.65,62.62,97.39,127.35,127.14,142.39
2,3,"Basel, Switzerland",126.89,46.14,88.66,120.44,129.10,141.48
3,4,"Lausanne, Switzerland",119.62,50.35,86.83,116.35,122.83,132.58
4,5,"Bern, Switzerland",118.42,39.22,80.93,114.54,114.86,115.48

In [4]:
ISO_file = "wikipedia-iso-country-codes.csv"
ISO_df = pd.read_csv(ISO_file)
ISO_df.head()

,English short name lower case,Alpha-2 code,Alpha-3 code,Numeric code,ISO 3166-2
0,Afghanistan,AF,AFG,4,ISO 3166-2:AF
1,Åland Islands,AX,ALA,248,ISO 3166-2:AX
2,Albania,AL,ALB,8,ISO 3166-2:AL
3,Algeria,DZ,DZA,12,ISO 3166-2:DZ
4,American Samoa,AS,ASM,16,ISO 3166-2:AS

### Transform Cities DataFrame

In [5]:
# Create a filtered dataframe from specific columns
cities_cols = ["name", "country code", "population"]
cities_transformed= cities_df[cities_cols].copy()

# Rename the column headers
cities_transformed = cities_transformed.rename(columns={"name": "City",
                                                          "country code": "Country_Code",
                                                          "population": "Population"})

# Clean the data by...

cities_transformed.head()

               City Country_Code Population
0      les Escaldes           AD      15853
1  Andorra la Vella           AD      20430
2    Umm al Qaywayn           AE      44411
3    Ras al-Khaimah           AE     115949
4     Khawr Fakkn           AE      33575

### Transform Cost of Living DataFrame

In [6]:
# Create a filtered dataframe from specific columns
cost_liv_cols = ["City", "Cost of Living Index"]
cost_liv_transformed= cost_liv_df[cost_liv_cols].copy()

# Rename the column headers
cost_liv_transformed = cost_liv_transformed.rename(columns={"City": "City",
                                                          "Cost of Living Index": "Cost_of_Living_Index"})

# Clean the data by...

cost_liv_transformed.head()

                    City  Cost_of_Living_Index
0      Hamilton, Bermuda                137.56
1    Zurich, Switzerland                128.65
2     Basel, Switzerland                126.89
3  Lausanne, Switzerland                119.62
4      Bern, Switzerland                118.42

### Transform ISO DataFrame

In [7]:
# Create a filtered dataframe from specific columns
ISO_cols = ["English short name lower case", "Alpha-2 code"]
ISO_transformed= ISO_df[ISO_cols].copy()

# Rename the column headers
ISO_transformed = ISO_transformed.rename(columns={"English short name lower case": "Country",
                                                          "Alpha-2 code": "Country_Code"})

# Clean the data by...

ISO_transformed

               Country Country_Code
0          Afghanistan           AF
1        Åland Islands           AX
2              Albania           AL
3              Algeria           DZ
4       American Samoa           AS
..                 ...          ...
241  Wallis and Futuna           WF
242     Western Sahara           EH
243              Yemen           YE
244             Zambia           ZM
245           Zimbabwe           ZW

[246 rows x 2 columns]

### Create database connection

In [8]:
connection_string = f'postgres:{password}@localhost:5432/city_db'

engine = create_engine(f'postgresql://{connection_string}')

In [9]:
engine

Engine(postgresql://postgres:***@localhost:5432/city_db)

In [10]:
#Confirm tables
engine.table_names()

['Cities', 'Cost_of_Living', 'ISO']

### Load DataFrames into database

In [11]:
cities_transformed.to_sql(name='Cities', con=engine, if_exists='append', index=True)

In [12]:
cost_liv_transformed.to_sql(name='Cost_of_Living', con=engine, if_exists='append', index=True)

In [13]:
ISO_transformed.to_sql(name='ISO', con=engine, if_exists='append', index=True)